andrewleech/micropython/ports/mimxrt/sdcard.c
    // Wait for command completion
    uint32_t start = mp_hal_ticks_ms();
    uint32_t xfer_status;
    while (((xfer_status = card->state->transfer_status) & TRANSFER_CMD_FLAGS) == 0) {
        if ((mp_hal_ticks_ms() - start) >= cmd_timeout_ms) {
            sdcard_error_recovery(base);
            return kStatus_Timeout;
        }
        // Tight poll - command completion is fast
    }

    if (xfer_status & TRANSFER_CMD_FAILED) {
        sdcard_error_recovery(base);
        return kStatus_USDHC_SendCommandFailed;
    }

    // Wait for data completion if present
    if (data != NULL) {
        start = mp_hal_ticks_ms();
        while (((xfer_status = card->state->transfer_status) & TRANSFER_DATA_FLAGS) == 0) {
            if ((mp_hal_ticks_ms() - start) >= data_timeout_ms) {
                sdcard_error_recovery(base);
                return kStatus_Timeout;
            }
            // Tight poll - we need precise timing for cache coherency
        }

        if (xfer_status & TRANSFER_DATA_FAILED) {
            sdcard_error_recovery(base);
            return kStatus_USDHC_TransferDataFailed;
        }

        // The callback already executed DSB/ISB before setting the complete flag,
        // so DMA writes should be fully visible. But we still need to invalidate
        // cache in case of speculative fills between IRQ handler and here.
        if (data->rxData != NULL) {
            // Additional barrier after exiting interrupt context
            __DSB();
            __ISB();
            size_t data_size = data->blockSize * data->blockCount;
            MP_HAL_CLEANINVALIDATE_DCACHE(data->rxData, data_size);
        }
    }

    return kStatus_Success;
}

// Wrapper that calls non-blocking implementation
static status_t sdcard_transfer_blocking(USDHC_Type *base, usdhc_transfer_t *transfer, uint32_t timeout_ms) {
    // Find card object from base address
    mimxrt_sdcard_obj_t *card = NULL;
    for (size_t i = 0; i < MP_ARRAY_SIZE(mimxrt_sdcard_objs); i++) {
        if (mimxrt_sdcard_objs[i].usdhc_inst == base) {
            card = &mimxrt_sdcard_objs[i];
            break;
        }
    }
    if (card == NULL) {
        return kStatus_Fail;
    }
    return sdcard_transfer_nonblocking(base, &card->handle, transfer, timeout_ms, timeout_ms);
}

#elif MICROPY_HW_SDCARD_POLLING
// ============================================================================
// Polling-based transfer mode: Uses SDK's USDHC_TransferBlocking for correct
// register setup and DMA handling, but yields to scheduler before data transfers
// to allow background tasks to run. The actual DMA transfer uses tight polling
// (fast), but we yield during the wait-for-ready phase.
// ============================================================================

// Wait for card to be ready by polling Data0 line.
// Data0 low indicates card is busy. Yields to scheduler while waiting.
static bool sdcard_polling_wait_data0_ready(USDHC_Type *base, uint32_t timeout_ms) {
    uint32_t start = mp_hal_ticks_ms();
    while ((mp_hal_ticks_ms() - start) < timeout_ms) {
        if ((USDHC_GetPresentStatusFlags(base) & (uint32_t)kUSDHC_Data0LineLevelFlag) != 0) {
            return true;
        }
        mp_event_handle_nowait();
    }
    return false;
}

// Scheduler-friendly blocking transfer.
// Uses SDK's USDHC_TransferBlocking which handles all the complex register setup,
// but waits for card ready state with scheduler yields beforehand.
static status_t sdcard_transfer_blocking(USDHC_Type *base, usdhc_transfer_t *transfer, uint32_t timeout_ms) {
    usdhc_data_t *data = transfer->data;

    usdhc_adma_config_t dma_config = {
        .dmaMode = kUSDHC_DmaModeAdma2,
        #if !(defined(FSL_FEATURE_USDHC_HAS_NO_RW_BURST_LEN) && FSL_FEATURE_USDHC_HAS_NO_RW_BURST_LEN)
        .burstLen = kUSDHC_EnBurstLenForINCR,
        #endif
        .admaTable = sdcard_adma_descriptor_table,
        .admaTableWords = DMA_DESCRIPTOR_BUFFER_SIZE,
    };

    // For data transfers, wait for card to be ready (yields to scheduler)
    bool has_data = (data != NULL) && ((data->txData != NULL) || (data->rxData != NULL));

    if (has_data && !sdcard_polling_wait_data0_ready(base, timeout_ms)) {
        return kStatus_Timeout;
    }

    // Use SDK blocking transfer - handles complex register setup correctly
    // and polls hardware status flags directly (no interrupts/callbacks)
    status_t error = USDHC_TransferBlocking(base, &dma_config, transfer);

    if (error != kStatus_Success) {
        sdcard_error_recovery(base);
    }
    return error;
}

#else // !MICROPY_HW_SDCARD_NONBLOCKING && !MICROPY_HW_SDCARD_POLLING

// Timing statistics (in microseconds) - enable with SDCARD_TIMING_DEBUG
#define SDCARD_TIMING_DEBUG (1)

#if SDCARD_TIMING_DEBUG
static volatile uint32_t sdcard_wait_time_us = 0;
static volatile uint32_t sdcard_xfer_time_us = 0;
static volatile uint32_t sdcard_xfer_count = 0;
#endif

// Wait for card to be ready by polling Data0 line.
// Data0 low indicates card is busy. Yields to scheduler while waiting.
static bool sdcard_wait_data0_ready(USDHC_Type *base, uint32_t timeout_ms) {
    uint32_t start = mp_hal_ticks_ms();
    while ((mp_hal_ticks_ms() - start) < timeout_ms) {
        if ((USDHC_GetPresentStatusFlags(base) & (uint32_t)kUSDHC_Data0LineLevelFlag) != 0) {
            return true;
        }
        mp_event_handle_nowait();
    }
    return false;
}

// Scheduler-friendly blocking transfer.
// Uses SDK's USDHC_TransferBlocking which handles all the complex register setup,
// but waits for card ready state with scheduler yields beforehand.
// The actual DMA transfer is fast once started, so tight polling there is acceptable.
static status_t sdcard_transfer_blocking(USDHC_Type *base, usdhc_transfer_t *transfer, uint32_t timeout_ms) {
    usdhc_data_t *data = transfer->data;

    usdhc_adma_config_t dma_config = {
        .dmaMode = kUSDHC_DmaModeAdma2,
        #if !(defined(FSL_FEATURE_USDHC_HAS_NO_RW_BURST_LEN) && FSL_FEATURE_USDHC_HAS_NO_RW_BURST_LEN)
        .burstLen = kUSDHC_EnBurstLenForINCR,
        #endif
        .admaTable = sdcard_adma_descriptor_table,
        .admaTableWords = DMA_DESCRIPTOR_BUFFER_SIZE,
    };

    // For data transfers, wait for card to be ready (yields to scheduler)
    bool has_data = (data != NULL) && ((data->txData != NULL) || (data->rxData != NULL));

    #if SDCARD_TIMING_DEBUG
    uint32_t t0 = ticks_us32();
    #endif

